# Utility Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..Utility Property
Connector Class See Also
---
Indicates if the connector is a utility connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool Utility { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Utility As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Utility {
	bool get ();
}
```

# See Also
Connector Class
Autodesk.Revit.DB Namespace